HTML_REPORTS/REPORT_20250719_214343/statistics.json
{
  "HTTP Request (Eminem's album checker)" : {
    "transaction" : "HTTP Request (Eminem's album checker)",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 239.5,
    "medianResTime" : 239.5,
    "minResTime" : 235.0,
    "maxResTime" : 244.0,
    "pct1ResTime" : 244.0,
    "pct2ResTime" : 244.0,
    "pct3ResTime" : 244.0,
    "throughput" : 0.47449584816132856,
    "receivedKBytesPerSec" : 9.848569098457888,
    "sentKBytesPerSec" : 0.18488656583629895
  },
  "HTTP Request Eminem" : {
    "transaction" : "HTTP Request Eminem",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 270.0,
    "medianResTime" : 270.0,
    "minResTime" : 267.0,
    "maxResTime" : 273.0,
    "pct1ResTime" : 273.0,
    "pct2ResTime" : 273.0,
    "pct3ResTime" : 273.0,
    "throughput" : 0.4711425206124853,
    "receivedKBytesPerSec" : 0.7048733804475854,
    "sentKBytesPerSec" : 0.14401133686690223
  },
  "HTTP Request (Eminem's top tracks)" : {
    "transaction" : "HTTP Request (Eminem's top tracks)",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 243.5,
    "medianResTime" : 243.5,
    "minResTime" : 234.0,
    "maxResTime" : 253.0,
    "pct1ResTime" : 253.0,
    "pct2ResTime" : 253.0,
    "pct3ResTime" : 253.0,
    "throughput" : 0.47472110135295514,
    "receivedKBytesPerSec" : 17.047308924756706,
    "sentKBytesPerSec" : 0.15020472347495845
  },
  "HTTP Request Owl City" : {
    "transaction" : "HTTP Request Owl City",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 245.0,
    "medianResTime" : 242.0,
    "minResTime" : 242.0,
    "maxResTime" : 251.0,
    "pct1ResTime" : 251.0,
    "pct2ResTime" : 251.0,
    "pct3ResTime" : 251.0,
    "throughput" : 0.4170721534825525,
    "receivedKBytesPerSec" : 0.617869586751008,
    "sentKBytesPerSec" : 0.1274839687891005
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 257.6,
    "medianResTime" : 245.0,
    "minResTime" : 215.0,
    "maxResTime" : 486.0,
    "pct1ResTime" : 277.5,
    "pct2ResTime" : 475.59999999999985,
    "pct3ResTime" : 486.0,
    "throughput" : 2.431019812811474,
    "receivedKBytesPerSec" : 36.756354837729425,
    "sentKBytesPerSec" : 0.8172642290628418
  },
  "HTTP Request (Owl City's album checker)" : {
    "transaction" : "HTTP Request (Owl City's album checker)",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 263.3333333333333,
    "medianResTime" : 262.0,
    "minResTime" : 250.0,
    "maxResTime" : 278.0,
    "pct1ResTime" : 278.0,
    "pct2ResTime" : 278.0,
    "pct3ResTime" : 278.0,
    "throughput" : 0.41946308724832215,
    "receivedKBytesPerSec" : 8.996745884018456,
    "sentKBytesPerSec" : 0.1634431365352349
  },
  "HTTP Request(get access token)" : {
    "transaction" : "HTTP Request(get access token)",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 285.6,
    "medianResTime" : 233.0,
    "minResTime" : 230.0,
    "maxResTime" : 486.0,
    "pct1ResTime" : 486.0,
    "pct2ResTime" : 486.0,
    "pct3ResTime" : 486.0,
    "throughput" : 0.6674676278200508,
    "receivedKBytesPerSec" : 0.6335727873448138,
    "sentKBytesPerSec" : 0.22227193465491923
  },
  "HTTP Request (Owl City's top tracks)" : {
    "transaction" : "HTTP Request (Owl City's top tracks)",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 231.0,
    "medianResTime" : 223.0,
    "minResTime" : 215.0,
    "maxResTime" : 255.0,
    "pct1ResTime" : 255.0,
    "pct2ResTime" : 255.0,
    "pct3ResTime" : 255.0,
    "throughput" : 0.42408821034775235,
    "receivedKBytesPerSec" : 15.908277671755725,
    "sentKBytesPerSec" : 0.13418416030534353
  }
}